In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
# ls data

# Q1-1

```
아래의 데이타를 이용하여 데이타프레임을 생성하여라.
name_list는 인덱스로 이용한다. 

data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']        
```


# Q1-2
```
2명의 데이타를 추가하여라. 

신머신	55	67	88
윤파이	90	100	90
```

# Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

# Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?


# Q1-5
```
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.
```

In [29]:
df

     kor  math  eng  sci  tot    avg pass
고길동   40    70   80   90  280  70.00    X
김희동   55    55   95   45  250  62.50    X
신윤지   66    66  100   77  309  77.25    O
이민호   77    20   77   90  264  66.00    X
박준희   34    40   90   67  231  57.75    X
신머신   55    67   88   90  300  75.00    O
윤파이   90   100   90   80  360  90.00    O

## ANS : Q1-1

In [8]:
# (1) 아래의 데이타를 이용하여 데이타프레임을 생성하여라.
   
data = {'kor':[40, 55, 66, 77, 34],
        'math':[70, 55, 66, 20, 40],
        'eng':[80, 95, 100, 77, 90]}
        
name_list = ['고길동','김희동','신윤지','이민호','박준희']    

df = pd.DataFrame(data, index=name_list)
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90

## ANS : Q1-2
2명의 데이타를 추가하여라.

In [9]:
df.loc['신머신']=[55, 67, 88]

In [10]:
df.loc['윤파이']=[90, 100, 90]

In [11]:
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90
신머신   55    67   88
윤파이   90   100   90

## ANS : Q1-3
sci 과목의 데이타를 추가하여라 

90, 45, 77, 90, 67, 90, 80

In [12]:
df['sci'] = [90, 45, 77, 90, 67, 90, 80]
df

     kor  math  eng  sci
고길동   40    70   80   90
김희동   55    55   95   45
신윤지   66    66  100   77
이민호   77    20   77   90
박준희   34    40   90   67
신머신   55    67   88   90
윤파이   90   100   90   80

## ANS : Q1-4
eng 과목에서 eng 평균점수보다 높은 학생은?

In [7]:
# eng과목의 평균점수 : 반올림 round(data, n)
round(df['eng'].mean(),2)

88.57

In [13]:
df['eng']>df['eng'].mean()

고길동    False
김희동     True
신윤지     True
이민호    False
박준희     True
신머신    False
윤파이     True
Name: eng, dtype: bool

In [14]:
df[df['eng']>df['eng'].mean()]

     kor  math  eng  sci
김희동   55    55   95   45
신윤지   66    66  100   77
박준희   34    40   90   67
윤파이   90   100   90   80

In [15]:
df[df['eng']>df['eng'].mean()].index

Index(['김희동', '신윤지', '박준희', '윤파이'], dtype='object')

In [16]:
list(df[df['eng']>df['eng'].mean()].index)

['김희동', '신윤지', '박준희', '윤파이']

In [17]:
for student in list(df[df['eng']>df['eng'].mean()].index):
    print(student)

김희동
신윤지
박준희
윤파이

## ANS : Q1-5
전체 과목의 평균을 구한 후 평균이상이면 O, 평균미만이면 X를 pass 컬럼에 출력하여라.

In [18]:
df['tot'] = df['kor']+df['math']+df['eng']+df['sci']
# df['tot'] = df.sum(axis=1)
# df['avg'] = df.sum(axis=1)
df['avg'] = round(df['tot']/4,2)

In [19]:
result = df['avg'].mean()
result

71.21428571428571

In [28]:
df.loc[df['avg']<result, 'pass'] = 'X'
df.loc[df['avg']>=result, 'pass'] = 'O'
df

     kor  math  eng  sci  tot    avg pass
고길동   40    70   80   90  280  70.00    X
김희동   55    55   95   45  250  62.50    X
신윤지   66    66  100   77  309  77.25    O
이민호   77    20   77   90  264  66.00    X
박준희   34    40   90   67  231  57.75    X
신머신   55    67   88   90  300  75.00    O
윤파이   90   100   90   80  360  90.00    O

## ANS 2-1
아래의 리스트를 이용하여 df_student 데이타프레임을 생성하여라 

```
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]
```

In [20]:
student_list = [ { 'name' : 'John', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Nate', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Abrabam', 'major' : 'Physics', 'gender' : 'male'},
                 { 'name' : 'Brian', 'major' : 'Psychology', 'gender' : 'male'},
                 { 'name' : 'Jenny', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Yuba', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Jennifer', 'major' : 'Computer Science', 'gender' : 'female'},
                 { 'name' : 'Edward', 'major' : 'Computer Science', 'gender' : 'male'},
                 { 'name' : 'Sara', 'major' : 'Psychology', 'gender' : 'female'},
                 { 'name' : 'Wendy', 'major' : 'Economics', 'gender' : 'female'},
                 { 'name' : 'Sera', 'major' : 'Psychology', 'gender' : 'female'}
               ]

In [21]:
df_student = pd.DataFrame(student_list)

In [22]:
df_student.sample(3)

     name       major  gender
8    Sara  Psychology  female
3   Brian  Psychology    male
10   Sera  Psychology  female

## ANS 2-2
df_student 데이타프레임의 인덱스를 std1 ~ std11 형태로 변경하여라

In [32]:
df_student

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abrabam           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuba         Economics  female
6   Jennifer  Computer Science  female
7     Edward  Computer Science    male
8       Sara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [ ]:
# df_student.index = ['std1', 'std2', 'std3', 'std4',...]

In [23]:
['std'+str(i+1) for i in range(df_student.shape[0])]

['std1',
 'std2',
 'std3',
 'std4',
 'std5',
 'std6',
 'std7',
 'std8',
 'std9',
 'std10',
 'std11']

In [26]:
[f'std{i}' for i in range(df_student.shape[0])]

['std0',
 'std1',
 'std2',
 'std3',
 'std4',
 'std5',
 'std6',
 'std7',
 'std8',
 'std9',
 'std10']

In [27]:
df_student.index = ['std'+str(i+1) for i in range(df_student.shape[0])]

In [28]:
df_student

           name             major  gender
std1       John  Computer Science    male
std2       Nate  Computer Science    male
std3    Abrabam           Physics    male
std4      Brian        Psychology    male
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std8     Edward  Computer Science    male
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## ANS 2-3
df_student 데이타프레임에서 gender 컬럼이 female 값을 가진 데이타만 별도로 데이타프레임 df_student_female 로 생성하여라.

In [29]:
df_student_female = df_student[df_student['gender'] == 'female'].copy()
df_student_female

           name             major  gender
std5      Jenny         Economics  female
std6       Yuba         Economics  female
std7   Jennifer  Computer Science  female
std9       Sara        Psychology  female
std10     Wendy         Economics  female
std11      Sera        Psychology  female

## ANS 2-4
df_student_female 데이타프레임에서 name 컬럼을 인덱스로 설정하고 gender 컬럼을 삭제하여라

In [57]:
# df_student_female.set_index('name', inplace=True)
# df_student_female

In [62]:
df_student_female.index = df_student_female['name']
df_student_female

              name             major  gender
name
Jenny        Jenny         Economics  female
Yuba          Yuba         Economics  female
Jennifer  Jennifer  Computer Science  female
Sara          Sara        Psychology  female
Wendy        Wendy         Economics  female
Sera          Sera        Psychology  female

In [63]:
df_student_female.drop(['name', 'gender'], axis=1)

                     major
name
Jenny            Economics
Yuba             Economics
Jennifer  Computer Science
Sara            Psychology
Wendy            Economics
Sera            Psychology

## ANS 2-5
df_student 데이타프레임에서 'Computer Science' 과를 제외한 나머지 데이타로 데이타프레임 df_student2를 생성하여라. 이때 인덱스는 name 컬럼으로 변경한다

In [30]:
df_student2 = df_student[df_student['major'] != 'Computer Science' ].copy()
df_student2.set_index('name', inplace=True)
df_student2

              major  gender
name
Abrabam     Physics    male
Brian    Psychology    male
Jenny     Economics  female
Yuba      Economics  female
Sara     Psychology  female
Wendy     Economics  female
Sera     Psychology  female

## ANS 2-6
df_student2 에서 Brian, Sara의 데이타를 삭제하고 grade 컬럼을 추가하여라 

4.5, 4.0, 3.5, 4.0, 3.0

In [31]:
df_student2.drop(['Brian', 'Sara'], axis=0, inplace=True)

In [32]:
df_student2['grade'] = [4.5, 4.0, 3.5, 4.0, 3.0]
df_student2

              major  gender  grade
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

## ANS 2-7
df_student2 데이타프레임에서 grade 컬럼명을 score로 변경하고 <br>
전체 컬럼 순서를 gender, score, major 순서로 변경하여라

In [33]:
# df_student2.columns
# df_student2.columns = ['major', 'gender', 'score']

Index(['major', 'gender', 'grade'], dtype='object')

In [34]:
# 특정 컬럼명만 교체 
# rename(columns={old: new})
df_student2 = df_student2.rename(columns={'grade': 'score'})
df_student2

              major  gender  score
name
Abrabam     Physics    male    4.5
Jenny     Economics  female    4.0
Yuba      Economics  female    3.5
Wendy     Economics  female    4.0
Sera     Psychology  female    3.0

In [35]:
# 전체 컬럼 순서를 gender, score, major 순서
df_student2 = df_student2[['gender', 'score', 'major']]
df_student2

         gender  score       major
name
Abrabam    male    4.5     Physics
Jenny    female    4.0   Economics
Yuba     female    3.5   Economics
Wendy    female    4.0   Economics
Sera     female    3.0  Psychology

## ANS 2-8
df_student2.describe() 명령을 이용하여 아래와 같이 출력하여라

In [36]:
df_student2.describe()

          score
count  5.000000
mean   3.800000
std    0.570088
min    3.000000
25%    3.500000
50%    4.000000
75%    4.000000
max    4.500000

In [78]:
df_student2.describe().loc[['mean', '25%', '50%', '75%']]

      grade
mean    3.8
25%     3.5
50%     4.0
75%     4.0

## ANS : Q3-1
```
아래의 CSV 파일을 df_weather 데이타프레임으로 생성하여라. 
이때 컬럼은 일시, 평균기온, 최고기온, 최저기온 으로만 한다 

기상온도_서울202012.csv

```

In [38]:
#  pd.read_csv('data/기상온도_서울202012.csv', encoding='cp949')

In [39]:
df_weather = pd.read_csv('data/기상온도_서울202012.csv', encoding='cp949', usecols=[2, 3, 5, 8])

In [40]:
df_weather.head()

           일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0  1907-10-01     13.9     25.4      3.3
1  1907-11-01      5.3     21.3     -8.9
2  1907-12-01     -3.9      9.0    -20.1
3  1908-01-01     -3.5      6.2    -14.3
4  1908-02-01     -4.0      8.4    -15.8

## ANS : Q3-2
```
df_weather 데이타프레임에서 결측값이 각 컬럼별로 몇개가 있는지 출력하여라 
```

일시          8
평균기온(℃)    33
최고기온(℃)    33
최저기온(℃)    33
dtype: int64

In [41]:
df_weather.shape

(1353, 4)

In [97]:
df_weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1353 entries, 0 to 1352
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   일시       1345 non-null   object
 1   평균기온(℃)  1320 non-null   float64
 2   최고기온(℃)  1320 non-null   float64
 3   최저기온(℃)  1320 non-null   float64
dtypes: float64(3), object(1)
memory usage: 42.4+ KB

In [43]:
df_weather.isnull()

         일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
0     False    False    False    False
1     False    False    False    False
2     False    False    False    False
3     False    False    False    False
4     False    False    False    False
...     ...      ...      ...      ...
1348   True     True     True     True
1349   True     True     True     True
1350   True     True     True     True
1351   True     True     True     True
1352   True     True     True     True

[1353 rows x 4 columns]

In [42]:
df_weather.isnull().sum()

일시          8
평균기온(℃)    33
최고기온(℃)    33
최저기온(℃)    33
dtype: int64

## ANS : Q3-3
```
df_weather 데이타프레임에서 '일시' 컬럼값이 결측값 NaN으로 지정된 데이타를 출력하여라 
```

In [110]:
df_weather.isnull()['일시'].sum()

8

In [44]:
df_weather[df_weather.isnull()['일시']]

       일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
1345  NaN      NaN      NaN      NaN
1346  NaN      NaN      NaN      NaN
1347  NaN      NaN      NaN      NaN
1348  NaN      NaN      NaN      NaN
1349  NaN      NaN      NaN      NaN
1350  NaN      NaN      NaN      NaN
1351  NaN      NaN      NaN      NaN
1352  NaN      NaN      NaN      NaN

In [45]:
df_weather[df_weather.isnull()['일시']].index

Int64Index([1345, 1346, 1347, 1348, 1349, 1350, 1351, 1352], dtype='int64')

## ANS : Q3-4
```
df_weather 데이타프레임에서 행 모두의 값이 NaN이면 삭제하여라 
```

In [46]:
df_weather.dropna(how="all", inplace=True)

In [47]:
df_weather[df_weather.isnull()['일시']]

Empty DataFrame
Columns: [일시, 평균기온(℃), 최고기온(℃), 최저기온(℃)]
Index: []

In [48]:
df_weather.isnull().sum()

일시          0
평균기온(℃)    25
최고기온(℃)    25
최저기온(℃)    25
dtype: int64

## ANS : Q3-5
```
df_weather 데이타프레임에서 결측값을 모두 0으로 변경하여라
```

In [118]:
df_weather[df_weather.isnull()['평균기온(℃)']]

             일시  평균기온(℃)  최고기온(℃)  최저기온(℃)
515  1950-09-01      NaN      NaN      NaN
516  1950-10-01      NaN      NaN      NaN
517  1951-12-01      NaN      NaN      NaN
518  1952-01-01      NaN      NaN      NaN
519  1952-02-01      NaN      NaN      NaN
520  1952-03-01      NaN      NaN      NaN
521  1952-04-01      NaN      NaN      NaN
522  1952-05-01      NaN      NaN      NaN
523  1952-06-01      NaN      NaN      NaN
524  1952-07-01      NaN      NaN      NaN
525  1952-09-01      NaN      NaN      NaN
526  1952-10-01      NaN      NaN      NaN
527  1952-11-01      NaN      NaN      NaN
528  1952-12-01      NaN      NaN      NaN
529  1953-01-01      NaN      NaN      NaN
530  1953-02-01      NaN      NaN      NaN
531  1953-03-01      NaN      NaN      NaN
532  1953-04-01      NaN      NaN      NaN
533  1953-05-01      NaN      NaN      NaN
534  1953-06-01      NaN      NaN      NaN
535  1953-07-01      NaN      NaN      NaN
536  1953-08-01      NaN      NaN      NaN
537  1953-09-01      NaN      NaN      NaN
538  1953-10-01      NaN      NaN      NaN
539  1953-11-01      NaN      NaN      NaN

In [49]:
df_weather.fillna(value=0, inplace=True)

In [50]:
df_weather[df_weather.isnull()['평균기온(℃)']]

Empty DataFrame
Columns: [일시, 평균기온(℃), 최고기온(℃), 최저기온(℃)]
Index: []

In [51]:
df_weather.isnull().sum()

일시         0
평균기온(℃)    0
최고기온(℃)    0
최저기온(℃)    0
dtype: int64

## ANS : Q3-6
```
df_weather 데이타프레임에서 '일시' 컬럼의 데이타형을 시계열 형태로 변경하고 인덱스로 설정하여라. 
```

In [52]:
df_weather.dtypes

일시          object
평균기온(℃)    float64
최고기온(℃)    float64
최저기온(℃)    float64
dtype: object

In [53]:
df_weather['일시'] = pd.to_datetime(df_weather['일시'])

In [54]:
df_weather.dtypes

일시         datetime64[ns]
평균기온(℃)           float64
최고기온(℃)           float64
최저기온(℃)           float64
dtype: object

In [55]:
df_weather.set_index('일시', inplace=True)

In [56]:
df_weather.head()

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
1907-10-01     13.9     25.4      3.3
1907-11-01      5.3     21.3     -8.9
1907-12-01     -3.9      9.0    -20.1
1908-01-01     -3.5      6.2    -14.3
1908-02-01     -4.0      8.4    -15.8

## ANS : Q3-7
```
df_weather 데이타프레임에서 2000 년 데이타만 출력하여라 
```

In [57]:
df_weather['2000']

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
2000-01-01     -2.1      9.9    -12.1
2000-02-01     -1.7      7.5    -11.6
2000-03-01      6.3     18.9     -4.8
2000-04-01     11.9     23.5      1.8
2000-05-01     17.5     30.5      7.9
2000-06-01     23.7     33.9     14.6
2000-07-01     26.8     34.2     19.9
2000-08-01     26.2     35.1     19.0
2000-09-01     20.7     31.0     11.9
2000-10-01     14.9     26.5      3.5
2000-11-01      7.0     20.3     -3.8
2000-12-01      0.9     11.9    -11.4

In [58]:
# 2000년 이후
df_weather['2000':]

            평균기온(℃)  최고기온(℃)  최저기온(℃)
일시
2000-01-01     -2.1      9.9    -12.1
2000-02-01     -1.7      7.5    -11.6
2000-03-01      6.3     18.9     -4.8
2000-04-01     11.9     23.5      1.8
2000-05-01     17.5     30.5      7.9
...             ...      ...      ...
2020-08-01     26.5     34.5     21.5
2020-09-01     21.4     29.5     13.6
2020-10-01     14.3     23.6      3.2
2020-11-01      8.0     20.0     -3.6
2020-12-01     -0.2      9.4    -11.2

[252 rows x 3 columns]